{
  "settings_Title": "Settings",
  "settings_DeleteAll": "Delete all local data",
  "settings_DeleteUserAndData": "Delete user",
  "settings_DeleteUserConfirmDialog": "Are you sure you want to delete your user?",
  "settings_DeleteUserErrorContactAdmin": "Unfortunately, an error occurred. Please log out and log in again. Otherwise, please contact us as per our legal notice.",
  "settings_EmailPasswordRequiredToDelete": "You must log in here to delete your account!",
  "settings_Information": "Information",
  "settings_Datenschutz": "Privacy Policy",
  "settings_Impressum": "Legal Notice",
  "settings_GitHubRepo": "GitHub Repository",
  "setting_Menu_OpenSourceModulList": "Used libraries",
  "setting_OpenSurceModulListTItle": "Used NPM libraries",
  "setting_OpenSourceModulListClose": "Close",
  "settings_Dialog_DeleteAllSuccessful": "All data has been successfully deleted. Please restart the application so that no new data is saved!",
  "settings_Dialog_DeleteAll": "Are you sure you want to delete all entries?",
  "navbar_searchForm": "Search card...",
  "newCard_Title": "New customer card",
  "newCard_shopForm": "Enter the shop name",
  "newCard_selectColor": "Select color",
  "newCard_scannedSuccessfully": "Successfully scanned: ",
  "newCard_addedSuccessfully": "Successfully added!",
  "newCard_errorAdding": "An error occurred, please try again!",
  "newCard_missingInformation": "Please enter the shop name and scan a card!",
  "noCardsThere": "No card here yet... Click the plus to add",
  "privacy.line_1": "<strong>This privacy policy is available in English and other languages.</strong>",
  "privacy.line_2": "<strong>To use another language, simply change your device's language setting.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Privacy Policy for Website/App</strong> <br /><br />",
  "privacy.line_4": "Thank you for visiting our website/app. We place great importance on the protection of your data and would like to provide you with an overview in this privacy policy of how we process your data in accordance with the General Data Protection Regulation (GDPR), European data protection laws, the California Consumer Privacy Act (CCPA), and Californian law. <br /> <br />",
  "privacy.line_5": "<strong>1. Responsible Entity</strong><br />",
  "privacy.line_6": "The entity responsible for processing your data and publisher of this app is: <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Contact phone: +49 176 21674883 <br />",
  "privacy.line_11": "Managing Director/Owner: Christian Scheub <br />",
  "privacy.line_12": "If you have any questions or concerns about data protection, feel free to contact us at christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Link to the imprint: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Cookies, IndexedDB and Similar Technologies</strong><br />",
  "privacy.line_15": "We use cookies and similar technologies to offer you personalized advertising and improve the performance of our website/app. This includes cookies stored on your device. These technologies help us store your preferences and optimize the user experience. <br />",
  "privacy.line_16": "We also use a local IndexedDB to store customer cards locally. Your customer cards always remain local. <br />",
  "privacy.line_17": "IndexedDB is a purely local SQL database in the browser, which you can imagine as a large table in which we store your data. <br /> <br />",
  "privacy.line_18": "<strong>3. Data Collection and Processing by AdMob and AdSense</strong><br />",
  "privacy.line_19": "We use AdMob and AdSense to show you personalized advertising. These services use cookies and similar technologies to collect data about your use of the website/app and to deliver tailored ads. The data collected by these services may include:",
  "privacy.line_20": "- Your IP address",
  "privacy.line_21": "- Information about your interactions with the website/app",
  "privacy.line_22": "- Device-specific information",
  "privacy.line_23": "The collected data is processed in accordance with Google’s privacy policies. You can find more information in the privacy policies of Google AdMob and Google AdSense. <br /> <br />To obtain your consent for personalized advertising, we use the <strong>Google User Messaging Platform (UMP)</strong>, which is based on the <strong>Transparency and Consent Framework (TCF) Version 2.2</strong> of <strong>IAB Europe</strong>. Upon first launch of the app or after your previous decision expires, you will be shown a consent prompt where you can specify whether and to what extent you agree to data processing. The collected consents cover personalized ads, measurement, and sharing with third parties. Your selection is stored locally and can be withdrawn or adjusted at any time. <br /> <br />",
  "privacy.line_24": "<strong>4. Sale of Data</strong><br />",
  "privacy.line_25": "We do not sell your data. Data collected by AdMob and AdSense is subject to the respective providers' privacy policies. <br /> <br />",
  "privacy.line_26": "<strong>5. Your Rights</strong><br />",
  "privacy.line_27": "You have the right to request information about the data we store about you, request its correction or deletion, and to restrict processing. Since we do not store any data ourselves, these rights apply to data collected by AdMob and AdSense. Please contact the respective providers for more information and to exercise your rights. <br /> <br />",
  "privacy.line_28": "<strong>6. Data Security</strong><br />",
  "privacy.line_29": "We strive to protect your data through appropriate technical and organizational measures. The security of your data is important to us, and we use security measures in accordance with legal requirements. <br /> <br />",
  "privacy.line_30": "<strong>7. Terms Used</strong><br />",
  "privacy.line_31": "Personal data refers to information relating to an identified or identifiable natural person. In this context, personal data may be collected and processed by AdMob and AdSense. <br /> <br />",
  "privacy.line_32": "<strong>8. Changes to This Privacy Policy</strong><br />",
  "privacy.line_33": "We reserve the right to change this privacy policy in order to comply with legal requirements or to reflect changes in our data processing practices. Please review this policy regularly to stay informed. <br />",
  "privacy.line_34": "Date: 03/05/2025 <br /> <br />",
  "privacy.update_2025_05": "Our privacy policy has been updated. We now explicitly state that we use the Google AdMob consent dialog (User Messaging Platform) to obtain your consent for data processing. Please review the updated privacy policy."
}
