{
  "settings_Title": "Paramètres",
  "settings_DeleteAll": "Supprimer toutes les données locales",
  "settings_DeleteUserAndData": "Supprimer l'utilisateur",
  "settings_DeleteUserConfirmDialog": "Êtes-vous sûr de vouloir supprimer votre utilisateur ?",
  "settings_DeleteUserErrorContactAdmin": "Une erreur s'est produite. Veuillez vous déconnecter et vous reconnecter. Si le problème persiste, veuillez nous contacter via les informations légales.",
  "settings_EmailPasswordRequiredToDelete": "Vous devez vous connecter ici pour supprimer votre compte !",
  "settings_Information": "Informations",
  "settings_Datenschutz": "Politique de confidentialité",
  "settings_Impressum": "Mentions légales",
  "settings_GitHubRepo": "Dépôt GitHub",
  "setting_Menu_OpenSourceModulList": "Bibliothèques utilisées",
  "setting_OpenSurceModulListTItle": "Bibliothèques NPM utilisées",
  "setting_OpenSourceModulListClose": "Fermer",
  "settings_Dialog_DeleteAllSuccessful": "Toutes les données ont été supprimées avec succès. Veuillez redémarrer l'application pour éviter l'enregistrement de nouvelles données !",
  "settings_Dialog_DeleteAll": "Êtes-vous sûr de vouloir supprimer toutes les entrées ?",
  "navbar_searchForm": "Rechercher une carte...",
  "noCardsThere": "Aucune carte ici pour le moment... Cliquez sur le bouton plus pour en ajouter une !",
  "newCard_Title": "Nouvelle carte client",
  "newCard_shopForm": "Entrez le nom du magasin",
  "newCard_selectColor": "Choisir une couleur",
  "newCard_scannedSuccessfully": "Scanné avec succès : ",
  "newCard_addedSuccessfully": "Ajouté avec succès !",
  "newCard_errorAdding": "Une erreur est survenue, veuillez réessayer !",
  "newCard_missingInformation": "Veuillez entrer le nom du magasin et scanner une carte !",

  "privacy.line_1": "<strong>Cette politique de confidentialité et les informations sont disponibles en anglais et dans d'autres langues.</strong>",
  "privacy.line_2": "<strong>Elle sera toujours affichée dans la langue de votre appareil, si nous la prenons en charge.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Politique de confidentialité pour le site web/l'application</strong> <br /><br />",
  "privacy.line_4": "Merci de visiter notre site web/application. Nous attachons une grande importance à la protection de vos données et souhaitons vous fournir un aperçu de la manière dont nous traitons vos données conformément au Règlement général sur la protection des données (RGPD), aux lois européennes sur la protection des données, au California Consumer Privacy Act (CCPA) et à la législation californienne. <br /> <br />",
  "privacy.line_5": "<strong>1. Responsable du traitement</strong><br />",
  "privacy.line_6": "Le responsable du traitement de vos données et éditeur de cette application est : <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Téléphone de contact : +49 176 21674883 <br />",
  "privacy.line_11": "Gérant/Propriétaire : Christian Scheub <br />",
  "privacy.line_12": "Pour toute question ou préoccupation concernant la protection des données, n'hésitez pas à nous contacter à l'adresse christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Lien vers les mentions légales : https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Cookies, IndexedDB et technologies similaires</strong><br />",
  "privacy.line_15": "Nous utilisons des cookies et des technologies similaires pour vous proposer des publicités personnalisées et améliorer les performances de notre site web/application. Cela inclut des cookies stockés sur votre appareil. Ces technologies nous aident à enregistrer vos préférences et à optimiser l'expérience utilisateur. <br />",
  "privacy.line_16": "Nous utilisons également une IndexedDB locale pour stocker localement les cartes client. Vos cartes client restent toujours locales. <br />",
  "privacy.line_17": "Une IndexedDB est une base de données SQL purement locale dans le navigateur, que vous pouvez imaginer comme une grande table dans laquelle nous stockons vos données. <br /> <br />",
  "privacy.line_18": "<strong>3. Collecte et traitement des données par AdMob et AdSense</strong><br />",
  "privacy.line_19": "Nous utilisons AdMob et AdSense pour vous afficher des publicités personnalisées. Ces services utilisent des cookies et des technologies similaires pour collecter des données sur votre utilisation du site web/application et proposer des publicités sur mesure. Les données collectées par ces services peuvent inclure :",
  "privacy.line_20": "- Votre adresse IP",
  "privacy.line_21": "- Informations sur vos interactions avec le site web/l'application",
  "privacy.line_22": "- Informations spécifiques à l'appareil",
  "privacy.line_23": "Les données collectées sont traitées conformément aux politiques de confidentialité de Google. Pour plus d'informations, veuillez consulter les politiques de confidentialité de Google AdMob et Google AdSense. <br /> <br />Pour obtenir votre consentement pour la publicité personnalisée, nous utilisons la <strong>Google User Messaging Platform (UMP)</strong>, qui est basée sur le <strong>Transparency and Consent Framework (TCF) Version 2.2</strong> de l'<strong>IAB Europe</strong>. Lors du premier lancement de l'application ou après l'expiration de votre décision précédente, une demande de consentement vous sera présentée, vous permettant de spécifier si et dans quelle mesure vous acceptez le traitement des données. Les consentements recueillis concernent notamment les annonces personnalisées, les mesures et le partage avec des tiers. Vos choix sont enregistrés localement et peuvent être révoqués ou modifiés à tout moment. <br /> <br />",
  "privacy.line_24": "<strong>4. Vente de données</strong><br />",
  "privacy.line_25": "Nous ne vendons aucune de vos données. Les données collectées par AdMob et AdSense sont soumises aux politiques de confidentialité des fournisseurs respectifs. <br /> <br />",
  "privacy.line_26": "<strong>5. Vos droits</strong><br />",
  "privacy.line_27": "Vous avez le droit de demander des informations sur les données stockées vous concernant, de demander leur rectification ou leur suppression, ainsi que de limiter le traitement. Étant donné que nous ne stockons pas de données propres, ces droits concernent les données collectées par AdMob et AdSense. Veuillez contacter les fournisseurs respectifs pour plus d'informations et pour exercer vos droits. <br /> <br />",
  "privacy.line_28": "<strong>6. Sécurité des données</strong><br />",
  "privacy.line_29": "Nous nous efforçons de protéger vos données par des mesures techniques et organisationnelles appropriées. La sécurité de vos données est importante pour nous, et nous utilisons des mesures de sécurité conformes aux exigences légales. <br /> <br />",
  "privacy.line_30": "<strong>7. Terminologie utilisée</strong><br />",
  "privacy.line_31": "Les données personnelles sont des informations se rapportant à une personne physique identifiée ou identifiable. Dans ce contexte, des données personnelles peuvent être collectées et traitées par AdMob et AdSense. <br /> <br />",
  "privacy.line_32": "<strong>8. Modifications de cette politique de confidentialité</strong><br />",
  "privacy.line_33": "Nous nous réservons le droit de modifier cette politique de confidentialité pour nous conformer aux exigences légales ou refléter les changements dans nos pratiques de traitement des données. Veuillez consulter régulièrement cette déclaration pour rester informé. <br />",
  "privacy.line_34": "Date : 03.05.2025 <br /> <br />",
  "privacy.update_2025_05": "Notre politique de confidentialité a été mise à jour. Nous précisons désormais que nous utilisons la boîte de dialogue de consentement Google AdMob (User Messaging Platform) pour recueillir votre consentement au traitement des données. Veuillez consulter la politique de confidentialité mise à jour."
}
