{
  "settings_Title": "Impostazioni",
  "settings_DeleteAll": "Elimina tutti i dati locali",
  "settings_DeleteUserAndData": "Elimina utente",
  "settings_DeleteUserConfirmDialog": "Sei sicuro di voler eliminare il tuo utente?",
  "settings_DeleteUserErrorContactAdmin": "Si è verificato un errore. Effettua il logout e accedi di nuovo. Se il problema persiste, contattaci come indicato nelle informazioni legali.",
  "settings_EmailPasswordRequiredToDelete": "Devi effettuare l'accesso per eliminare il tuo account!",
  "settings_Information": "Informazioni",
  "settings_Datenschutz": "Informativa sulla privacy",
  "settings_Impressum": "Note legali",
  "settings_GitHubRepo": "Repository GitHub",
  "setting_Menu_OpenSourceModulList": "Librerie utilizzate",
  "setting_OpenSurceModulListTItle": "Librerie NPM utilizzate",
  "setting_OpenSourceModulListClose": "Chiudi",
  "settings_Dialog_DeleteAllSuccessful": "Tutti i dati sono stati eliminati con successo. Riavvia l'applicazione per evitare il salvataggio di nuovi dati!",
  "settings_Dialog_DeleteAll": "Sei sicuro di voler eliminare tutte le voci?",
  "navbar_searchForm": "Cerca carta...",
  "noCardsThere": "Nessuna carta ancora... Clicca il pulsante più per aggiungerne una!",
  "newCard_Title": "Nuova carta cliente",
  "newCard_shopForm": "Inserisci il nome del negozio",
  "newCard_selectColor": "Seleziona un colore",
  "newCard_scannedSuccessfully": "Scansionato con successo: ",
  "newCard_addedSuccessfully": "Aggiunto con successo!",
  "newCard_errorAdding": "Si è verificato un errore, riprova!",
  "newCard_missingInformation": "Inserisci il nome del negozio e scansiona una carta!",

  "privacy.line_1": "<strong>Questa informativa sulla privacy e le informazioni sono disponibili in inglese e in altre lingue.</strong>",
  "privacy.line_2": "<strong>Verrà sempre visualizzata nella lingua del tuo dispositivo, se supportata.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Informativa sulla privacy per sito web/app</strong> <br /><br />",
  "privacy.line_4": "Grazie per aver visitato il nostro sito web/app. Attribuiamo grande importanza alla protezione dei tuoi dati e desideriamo fornirti una panoramica su come trattiamo i tuoi dati in conformità al Regolamento Generale sulla Protezione dei Dati (GDPR), alle leggi europee sulla protezione dei dati, al California Consumer Privacy Act (CCPA) e alla legislazione californiana. <br /> <br />",
  "privacy.line_5": "<strong>1. Titolare del trattamento</strong><br />",
  "privacy.line_6": "Il responsabile del trattamento dei tuoi dati e l'editore di questa app è: <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Telefono di contatto: +49 176 21674883 <br />",
  "privacy.line_11": "Amministratore/Proprietario: Christian Scheub <br />",
  "privacy.line_12": "Per domande o richieste relative alla privacy, non esitare a contattarci all'indirizzo christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Link all'impressum: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Cookie, IndexedDB e tecnologie simili</strong><br />",
  "privacy.line_15": "Utilizziamo cookie e tecnologie simili per offrirti pubblicità personalizzata e migliorare le prestazioni del nostro sito web/app. Ciò include cookie memorizzati sul tuo dispositivo. Queste tecnologie ci aiutano a salvare le tue preferenze e ottimizzare l'esperienza utente. <br />",
  "privacy.line_16": "Inoltre, utilizziamo una IndexedDB locale per memorizzare localmente le carte cliente. Le tue carte cliente rimangono sempre locali. <br />",
  "privacy.line_17": "Una IndexedDB è un database SQL puramente locale nel browser, che puoi immaginare come una grande tabella in cui memorizziamo i tuoi dati. <br /> <br />",
  "privacy.line_18": "<strong>3. Raccolta e trattamento dei dati tramite AdMob e AdSense</strong><br />",
  "privacy.line_19": "Utilizziamo AdMob e AdSense per mostrarti pubblicità personalizzata. Questi servizi utilizzano cookie e tecnologie simili per raccogliere dati sull'utilizzo del sito web/app e offrire pubblicità su misura. I dati raccolti da questi servizi possono includere:",
  "privacy.line_20": "- Il tuo indirizzo IP",
  "privacy.line_21": "- Informazioni sulle tue interazioni con il sito web/app",
  "privacy.line_22": "- Informazioni specifiche del dispositivo",
  "privacy.line_23": "I dati raccolti vengono trattati in conformità con le politiche sulla privacy di Google. Per ulteriori informazioni, consultare le politiche sulla privacy di Google AdMob e Google AdSense. <br /> <br />Per ottenere il tuo consenso alla pubblicità personalizzata, utilizziamo la <strong>Piattaforma di Messaggistica per gli Utenti di Google (UMP)</strong>, basata sul <strong>Transparency and Consent Framework (TCF) Versione 2.2</strong> dell'<strong>IAB Europe</strong>. Al primo avvio dell'app o dopo la scadenza della tua precedente decisione, ti verrà presentata una richiesta di consenso che ti permetterà di specificare se e in che misura acconsenti al trattamento dei dati. I consensi raccolti riguardano, tra l'altro, annunci personalizzati, misurazioni e condivisione con terze parti. Le tue scelte vengono salvate localmente e possono essere revocate o modificate in qualsiasi momento. <br /> <br />",
  "privacy.line_24": "<strong>4. Vendita dei dati</strong><br />",
  "privacy.line_25": "Non vendiamo i tuoi dati. I dati raccolti da AdMob e AdSense sono soggetti alle politiche sulla privacy dei rispettivi fornitori. <br /> <br />",
  "privacy.line_26": "<strong>5. I tuoi diritti</strong><br />",
  "privacy.line_27": "Hai il diritto di richiedere informazioni sui dati memorizzati su di te, di richiederne la correzione o la cancellazione, nonché di limitarne il trattamento. Poiché non memorizziamo dati propri, questi diritti si riferiscono ai dati raccolti da AdMob e AdSense. Ti preghiamo di contattare i rispettivi fornitori per ulteriori informazioni e per esercitare i tuoi diritti. <br /> <br />",
  "privacy.line_28": "<strong>6. Sicurezza dei dati</strong><br />",
  "privacy.line_29": "Ci impegniamo a proteggere i tuoi dati attraverso misure tecniche e organizzative adeguate. La sicurezza dei tuoi dati è importante per noi e utilizziamo misure di sicurezza conformi ai requisiti legali. <br /> <br />",
  "privacy.line_30": "<strong>7. Terminologia utilizzata</strong><br />",
  "privacy.line_31": "I dati personali sono informazioni che si riferiscono a una persona fisica identificata o identificabile. In questo contesto, i dati personali possono essere raccolti e trattati da AdMob e AdSense. <br /> <br />",
  "privacy.line_32": "<strong>8. Modifiche a questa informativa sulla privacy</strong><br />",
  "privacy.line_33": "Ci riserviamo il diritto di modificare questa informativa sulla privacy per conformarci ai requisiti legali o per riflettere le modifiche nelle nostre pratiche di trattamento dei dati. Ti invitiamo a controllare regolarmente questa dichiarazione per rimanere aggiornato. <br />",
  "privacy.line_34": "Data: 03.05.2025 <br /> <br />",
  "privacy.update_2025_05": "La nostra informativa sulla privacy è stata aggiornata. Ora specifichiamo che utilizziamo la finestra di dialogo per il consenso di Google AdMob (User Messaging Platform) per ottenere il tuo consenso al trattamento dei dati. Si prega di consultare l'informativa sulla privacy aggiornata."
}
