{
  "settings_Title": "सेटिंग्स",
  "settings_DeleteAll": "सभी स्थानीय डेटा हटाएं",
  "settings_DeleteUserAndData": "उपयोगकर्ता हटाएं",
  "settings_DeleteUserConfirmDialog": "क्या आप वाकई अपना उपयोगकर्ता हटाना चाहते हैं?",
  "settings_DeleteUserErrorContactAdmin": "दुर्भाग्यवश, एक त्रुटि हुई है। कृपया लॉगआउट करें और पुनः लॉगिन करें। अन्यथा, कृपया हमारे कानूनी सूचना के अनुसार हमसे संपर्क करें।",
  "settings_EmailPasswordRequiredToDelete": "अपने खाते को हटाने के लिए आपको यहाँ लॉगिन करना होगा!",
  "settings_Information": "जानकारी",
  "settings_Datenschutz": "गोपनीयता नीति",
  "settings_Impressum": "कानूनी सूचना",
  "settings_GitHubRepo": "GitHub रिपॉजिटरी",
  "setting_Menu_OpenSourceModulList": "उपयोग की गई लाइब्रेरी",
  "setting_OpenSurceModulListTItle": "प्रयुक्त NPM लाइब्रेरी",
  "setting_OpenSourceModulListClose": "बंद करें",
  "settings_Dialog_DeleteAllSuccessful": "सभी डेटा सफलतापूर्वक हटा दिए गए हैं। कृपया नए डेटा को सहेजने से रोकने के लिए एप्लिकेशन को पुनः प्रारंभ करें!",
  "settings_Dialog_DeleteAll": "क्या आप वाकई सभी प्रविष्टियों को हटाना चाहते हैं?",
  "navbar_searchForm": "कार्ड खोजें...",
  "noCardsThere": "अभी तक कोई कार्ड नहीं... जोड़ने के लिए प्लस बटन दबाएं!",
  "newCard_Title": "नया ग्राहक कार्ड",
  "newCard_shopForm": "दुकान का नाम दर्ज करें",
  "newCard_selectColor": "रंग चुनें",
  "newCard_scannedSuccessfully": "सफलतापूर्वक स्कैन किया गया: ",
  "newCard_addedSuccessfully": "सफलतापूर्वक जोड़ा गया!",
  "newCard_errorAdding": "एक त्रुटि हुई, कृपया पुनः प्रयास करें!",
  "newCard_missingInformation": "कृपया दुकान का नाम दर्ज करें और एक कार्ड स्कैन करें!",

  "privacy.line_1": "<strong>यह गोपनीयता नीति और जानकारी अंग्रेजी और अन्य भाषाओं में उपलब्ध है।</strong>",
  "privacy.line_2": "<strong>यदि हम समर्थन करते हैं, तो यह हमेशा आपके डिवाइस की भाषा में प्रदर्शित होगी।</strong> <br /> <br />",
  "privacy.line_3": "<strong>वेबसाइट/ऐप के लिए गोपनीयता नीति</strong> <br /><br />",
  "privacy.line_4": "हमारी वेबसाइट/ऐप पर आपकी यात्रा के लिए धन्यवाद। हम आपके डेटा की सुरक्षा को अत्यधिक महत्व देते हैं और इस गोपनीयता नीति के माध्यम से आपको यह अवलोकन प्रदान करना चाहते हैं कि हम आपके डेटा को सामान्य डेटा संरक्षण विनियमन (GDPR), यूरोपीय डेटा संरक्षण कानूनों, कैलिफ़ोर्निया उपभोक्ता गोपनीयता अधिनियम (CCPA) और कैलिफ़ोर्निया कानून के अनुसार कैसे संसाधित करते हैं। <br /> <br />",
  "privacy.line_5": "<strong>1. जिम्मेदार संस्था</strong><br />",
  "privacy.line_6": "आपके डेटा की प्रोसेसिंग के लिए जिम्मेदार और इस ऐप के प्रकाशक हैं: <br />",
  "privacy.line_7": "क्रिश्चियन शॉइब <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "संपर्क फोन: +49 176 21674883 <br />",
  "privacy.line_11": "प्रबंध निदेशक/मालिक: क्रिश्चियन शॉइब <br />",
  "privacy.line_12": "यदि आपके पास गोपनीयता के बारे में कोई प्रश्न या चिंता है, तो कृपया हमें christian.developer.app@gmail.com पर संपर्क करें। <br />",
  "privacy.line_13": "इंप्रेसम का लिंक: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. कुकीज़, IndexedDB और समान तकनीकें</strong><br />",
  "privacy.line_15": "हम आपको व्यक्तिगत विज्ञापन प्रदान करने और हमारी वेबसाइट/ऐप के प्रदर्शन को बेहतर बनाने के लिए कुकीज़ और समान तकनीकों का उपयोग करते हैं। इसमें आपके डिवाइस पर संग्रहीत कुकीज़ शामिल हैं। ये तकनीकें हमें आपकी प्राथमिकताओं को संग्रहीत करने और उपयोगकर्ता अनुभव को अनुकूलित करने में मदद करती हैं। <br />",
  "privacy.line_16": "इसके अलावा, हम ग्राहक कार्डों को स्थानीय रूप से संग्रहीत करने के लिए एक स्थानीय IndexedDB का उपयोग करते हैं। आपके ग्राहक कार्ड हमेशा स्थानीय रहते हैं। <br />",
  "privacy.line_17": "एक IndexedDB ब्राउज़र में एक पूरी तरह से स्थानीय SQL डेटाबेस है जिसे आप एक बड़ी तालिका के रूप में कल्पना कर सकते हैं जिसमें हम आपके डेटा को संग्रहीत करते हैं। <br /> <br />",
  "privacy.line_18": "<strong>3. AdMob और AdSense द्वारा डेटा का संग्रहण और प्रोसेसिंग</strong><br />",
  "privacy.line_19": "हम आपको व्यक्तिगत विज्ञापन दिखाने के लिए AdMob और AdSense का उपयोग करते हैं। ये सेवाएं आपकी वेबसाइट/ऐप के उपयोग के बारे में डेटा एकत्र करने और अनुकूलित विज्ञापन प्रदान करने के लिए कुकीज़ और समान तकनीकों का उपयोग करती हैं। इन सेवाओं द्वारा एकत्र किए गए डेटा में निम्नलिखित शामिल हो सकते हैं:",
  "privacy.line_20": "- आपका IP पता",
  "privacy.line_21": "- वेबसाइट/ऐप के साथ आपकी इंटरैक्शन के बारे में जानकारी",
  "privacy.line_22": "- डिवाइस-विशिष्ट जानकारी",
  "privacy.line_23": "संग्रहित डेटा को Google की गोपनीयता नीतियों के अनुसार संसाधित किया जाता है। अधिक जानकारी के लिए, कृपया Google AdMob और Google AdSense की गोपनीयता नीतियों को देखें। <br /> <br />व्यक्तिगत विज्ञापन के लिए आपकी सहमति प्राप्त करने के लिए, हम <strong>Google उपयोगकर्ता संदेश प्लेटफ़ॉर्म (UMP)</strong> का उपयोग करते हैं, जो <strong>IAB Europe</strong> के <strong>Transparency and Consent Framework (TCF) संस्करण 2.2</strong> पर आधारित है। ऐप के पहले लॉन्च पर या आपकी पिछली निर्णय की समाप्ति के बाद, आपको एक सहमति अनुरोध प्रस्तुत किया जाएगा, जिससे आप यह निर्दिष्ट कर सकते हैं कि आप डेटा प्रसंस्करण के लिए सहमत हैं या नहीं और किस हद तक। एकत्रित सहमतियाँ व्यक्तिगत विज्ञापनों, माप और तृतीय पक्षों के साथ साझा करने से संबंधित हैं। आपके विकल्प स्थानीय रूप से संग्रहीत किए जाते हैं और किसी भी समय रद्द या संशोधित किए जा सकते हैं। <br /> <br />",  "privacy.line_24": "<strong>4. डेटा की बिक्री</strong><br />",
  "privacy.line_25": "हम आपके किसी भी डेटा को नहीं बेचते हैं। AdMob और AdSense द्वारा एकत्र किए गए डेटा संबंधित प्रदाताओं की गोपनीयता नीतियों के अधीन हैं। <br /> <br />",
  "privacy.line_26": "<strong>5. आपके अधिकार</strong><br />",
  "privacy.line_27": "आपके पास आपके बारे में संग्रहीत डेटा की जानकारी प्राप्त करने, उन्हें सुधारने या हटाने का अनुरोध करने और प्रोसेसिंग को सीमित करने का अधिकार है। चूंकि हम कोई भी डेटा स्वयं संग्रहीत नहीं करते हैं, ये अधिकार AdMob और AdSense द्वारा एकत्र किए गए डेटा पर लागू होते हैं। कृपया अधिक जानकारी और अपने अधिकारों का उपयोग करने के लिए संबंधित प्रदाताओं से संपर्क करें। <br /> <br />",
  "privacy.line_28": "<strong>6. डेटा सुरक्षा</strong><br />",
  "privacy.line_29": "हम आपके डेटा की सुरक्षा के लिए उपयुक्त तकनीकी और संगठनात्मक उपायों के माध्यम से प्रयास करते हैं। आपके डेटा की सुरक्षा हमारे लिए महत्वपूर्ण है, और हम कानूनी आवश्यकताओं के अनुसार सुरक्षा-संबंधी उपायों का उपयोग करते हैं। <br /> <br />",
  "privacy.line_30": "<strong>7. प्रयुक्त शब्दावली</strong><br />",
  "privacy.line_31": "व्यक्तिगत डेटा ऐसी जानकारी है जो एक पहचानी गई या पहचाने जा सकने वाली प्राकृतिक व्यक्ति से संबंधित होती है। इस संदर्भ में, AdMob और AdSense द्वारा व्यक्तिगत डेटा एकत्र और प्रोसेस किया जा सकता है। <br /> <br />",
  "privacy.line_32": "<strong>8. इस गोपनीयता नीति में परिवर्तन</strong><br />",
  "privacy.line_33": "हम इस गोपनीयता नीति को कानूनी आवश्यकताओं के अनुरूप बनाने या हमारे डेटा प्रोसेसिंग प्रथाओं में परिवर्तनों को दर्शाने के लिए इसे बदलने का अधिकार सुरक्षित रखते हैं। कृपया अद्यतित रहने के लिए इस नीति की नियमित रूप से समीक्षा करें। <br />",
  "privacy.line_34": "दिनांक: 03.05.2025 <br /> <br />",
  "privacy.update_2025_05": "हमारी गोपनीयता नीति को अपडेट किया गया है। अब हम स्पष्ट रूप से बताते हैं कि हम डेटा प्रोसेसिंग के लिए आपकी सहमति प्राप्त करने हेतु Google AdMob सहमति संवाद (User Messaging Platform) का उपयोग करते हैं। कृपया अपडेट की गई गोपनीयता नीति की समीक्षा करें।"
}
