{
  "settings_Title": "Asetukset",
  "settings_DeleteAll": "Poista kaikki paikalliset tiedot",
  "settings_DeleteUserAndData": "Poista käyttäjä",
  "settings_DeleteUserConfirmDialog": "Oletko varma, että haluat poistaa käyttäjän?",
  "settings_DeleteUserErrorContactAdmin": "Valitettavasti tapahtui virhe. Kirjaudu ulos ja sisään uudelleen. Jos ongelma jatkuu, ota meihin yhteyttä oikeudellisen ilmoituksen mukaisesti.",
  "settings_EmailPasswordRequiredToDelete": "Sinun on kirjauduttava sisään poistaaksesi tilisi!",
  "settings_Information": "Tiedot",
  "settings_Datenschutz": "Tietosuojakäytäntö",
  "settings_Impressum": "Oikeudellinen ilmoitus",
  "settings_GitHubRepo": "GitHub-repositorio",
  "setting_Menu_OpenSourceModulList": "Käytetyt kirjastot",
  "setting_OpenSurceModulListTItle": "Käytetyt NPM-kirjastot",
  "setting_OpenSourceModulListClose": "Sulje",
  "settings_Dialog_DeleteAllSuccessful": "Kaikki tiedot on poistettu onnistuneesti. Käynnistä sovellus uudelleen, jotta uusia tietoja ei tallenneta!",
  "settings_Dialog_DeleteAll": "Oletko varma, että haluat poistaa kaikki merkinnät?",
  "navbar_searchForm": "Etsi korttia...",
  "noCardsThere": "Ei kortteja vielä... Lisää painamalla plus-painiketta!",
  "newCard_Title": "Uusi asiakaskortti",
  "newCard_shopForm": "Syötä kaupan nimi",
  "newCard_selectColor": "Valitse väri",
  "newCard_scannedSuccessfully": "Skannattu onnistuneesti: ",
  "newCard_addedSuccessfully": "Lisätty onnistuneesti!",
  "newCard_errorAdding": "Tapahtui virhe, yritä uudelleen!",
  "newCard_missingInformation": "Anna kaupan nimi ja skannaa kortti!",

  "privacy.line_1": "<strong>Tämä tietosuojakäytäntö ja tiedot ovat saatavilla englanniksi ja muilla kielillä.</strong>",
  "privacy.line_2": "<strong>Se näytetään aina laitteesi kielellä, jos tuemme sitä.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Verkkosivuston/sovelluksen tietosuojakäytäntö</strong> <br /><br />",
  "privacy.line_4": "Kiitos, että vierailit verkkosivustollamme/sovelluksessamme. Arvostamme suuresti tietojesi suojaa ja haluamme antaa sinulle yleiskatsauksen siitä, miten käsittelemme tietojasi yleisen tietosuoja-asetuksen (GDPR), eurooppalaisten tietosuojalakien sekä Kalifornian kuluttajansuojalain (CCPA) ja Kalifornian lain mukaisesti. <br /> <br />",
  "privacy.line_5": "<strong>1. Rekisterinpitäjä</strong><br />",
  "privacy.line_6": "Tietojesi käsittelystä vastuussa oleva taho ja tämän sovelluksen julkaisija on: <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Yhteydenotto puhelimitse: +49 176 21674883 <br />",
  "privacy.line_11": "Toimitusjohtaja/Omistaja: Christian Scheub <br />",
  "privacy.line_12": "Jos sinulla on kysymyksiä tai huolenaiheita tietosuojasta, ota meihin yhteyttä osoitteessa christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Linkki impressumiin: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Evästeet, IndexedDB ja vastaavat teknologiat</strong><br />",
  "privacy.line_15": "Käytämme evästeitä ja vastaavia teknologioita tarjotaksemme sinulle personoitua mainontaa ja parantaaksemme verkkosivustomme/sovelluksemme suorituskykyä. Näihin kuuluvat laitteellesi tallennetut evästeet. Nämä teknologiat auttavat meitä tallentamaan mieltymyksesi ja optimoimaan käyttökokemuksen. <br />",
  "privacy.line_16": "Käytämme myös paikallista IndexedDB:tä asiakaskorttien paikalliseen tallentamiseen. Asiakaskorttisi pysyvät kuitenkin aina paikallisina. <br />",
  "privacy.line_17": "IndexedDB on täysin paikallinen SQL-tietokanta selaimessa, jonka voit kuvitella suureksi taulukoksi, johon tallennamme tietosi. <br /> <br />",
  "privacy.line_18": "<strong>3. Tietojen kerääminen ja käsittely AdMobin ja AdSensen kautta</strong><br />",
  "privacy.line_19": "Käytämme AdMobia ja AdSensea näyttääksemme sinulle personoitua mainontaa. Nämä palvelut käyttävät evästeitä ja vastaavia teknologioita kerätäkseen tietoja verkkosivuston/sovelluksen käytöstäsi ja tarjotakseen räätälöityä mainontaa. Näiden palveluiden keräämät tiedot voivat sisältää:",
  "privacy.line_20": "- IP-osoitteesi",
  "privacy.line_21": "- Tiedot vuorovaikutuksestasi verkkosivuston/sovelluksen kanssa",
  "privacy.line_22": "- Laitekohtaiset tiedot",
  "privacy.line_23": "Kerätyt tiedot käsitellään Googlen tietosuojakäytäntöjen mukaisesti. Lisätietoja löydät <a href=\"https://support.google.com/admob/answer/6128543\">Google AdMob</a> ja <a href=\"https://support.google.com/adsense/answer/7007310\">Google AdSense</a> tietosuojakäytännöistä. <br /> <br />Henkilökohtaistettujen mainosten suostumuksen hankkimiseksi käytämme <strong>Google User Messaging Platform (UMP)</strong> -alustaa, joka perustuu <strong>IAB Europen Transparency and Consent Framework (TCF) versioon 2.2</strong>. Sovelluksen ensimmäisellä käynnistyskerralla tai aiemman päätöksesi vanhennuttua sinulle näytetään suostumuspyyntö, jossa voit määrittää, hyväksytkö tietojesi käsittelyn ja missä laajuudessa. Kerätyt suostumukset koskevat muun muassa henkilökohtaistettuja mainoksia, mittauksia ja tietojen jakamista kolmansille osapuolille. Valintasi tallennetaan paikallisesti ja niitä voidaan muuttaa tai peruuttaa milloin tahansa. <br /> <br />",  "privacy.line_24": "<strong>4. Tietojen myynti</strong><br />",
  "privacy.line_25": "Emme myy tietojasi. AdMobin ja AdSensen keräämät tiedot kuuluvat kyseisten palveluntarjoajien tietosuojakäytäntöjen piiriin. <br /> <br />",
  "privacy.line_26": "<strong>5. Oikeutesi</strong><br />",
  "privacy.line_27": "Sinulla on oikeus pyytää tietoja sinusta tallennetuista tiedoista, pyytää niiden oikaisemista tai poistamista sekä rajoittaa käsittelyä. Koska emme tallenna omia tietoja, nämä oikeudet koskevat AdMobin ja AdSensen keräämiä tietoja. Ota yhteyttä kyseisiin palveluntarjoajiin saadaksesi lisätietoja ja käyttääksesi oikeuksiasi. <br /> <br />",
  "privacy.line_28": "<strong>6. Tietoturva</strong><br />",
  "privacy.line_29": "Pyrimme suojaamaan tietojasi asianmukaisilla teknisillä ja organisatorisilla toimenpiteillä. Tietojesi turvallisuus on meille tärkeää, ja käytämme turvallisuuteen liittyviä toimenpiteitä lakisääteisten vaatimusten mukaisesti. <br /> <br />",
  "privacy.line_30": "<strong>7. Käytetyt termit</strong><br />",
  "privacy.line_31": "Henkilötiedot ovat tietoja, jotka liittyvät tunnistettuun tai tunnistettavissa olevaan luonnolliseen henkilöön. Tässä yhteydessä AdMob ja AdSense voivat kerätä ja käsitellä henkilötietoja. <br /> <br />",
  "privacy.line_32": "<strong>8. Tietosuojakäytännön muutokset</strong><br />",
  "privacy.line_33": "Pidätämme oikeuden muuttaa tätä tietosuojakäytäntöä lakisääteisten vaatimusten täyttämiseksi tai tietojenkäsittelykäytäntöjemme muutosten heijastamiseksi. Tarkista tämä lausunto säännöllisesti pysyäksesi ajan tasalla. <br />",
  "privacy.line_34": "Päivämäärä: 03.05.2025 <br /> <br />",
  "privacy.update_2025_05": "Tietosuojakäytäntömme on päivitetty. Olemme nyt tarkentaneet, että käytämme Google AdMobin suostumusvalintaikkunaa (User Messaging Platform) saadaksemme suostumuksesi tietojenkäsittelyyn. Tutustu päivitettyyn tietosuojakäytäntöön."}
