{
  "settings_Title": "Ustawienia",
  "settings_DeleteAll": "Usuń wszystkie dane lokalne",
  "settings_DeleteUserAndData": "Usuń użytkownika",
  "settings_DeleteUserConfirmDialog": "Czy na pewno chcesz usunąć użytkownika?",
  "settings_DeleteUserErrorContactAdmin": "Wystąpił błąd. Wyloguj się i zaloguj ponownie. Jeśli problem nie ustąpi, skontaktuj się z nami przez informacje prawne.",
  "settings_EmailPasswordRequiredToDelete": "Aby usunąć konto, musisz się zalogować!",
  "settings_Information": "Informacje",
  "settings_Datenschutz": "Polityka prywatności",
  "settings_Impressum": "Nota prawna",
  "settings_GitHubRepo": "Repozytorium GitHub",
  "setting_Menu_OpenSourceModulList": "Używane biblioteki",
  "setting_OpenSurceModulListTItle": "Używane biblioteki NPM",
  "setting_OpenSourceModulListClose": "Zamknij",
  "settings_Dialog_DeleteAllSuccessful": "Wszystkie dane zostały pomyślnie usunięte. Uruchom ponownie aplikację, aby zapobiec zapisaniu nowych danych!",
  "settings_Dialog_DeleteAll": "Czy na pewno chcesz usunąć wszystkie wpisy?",
  "navbar_searchForm": "Wyszukaj kartę...",
  "noCardsThere": "Brak kart... Naciśnij przycisk plus, aby dodać!",
  "newCard_Title": "Nowa karta klienta",
  "newCard_shopForm": "Wpisz nazwę sklepu",
  "newCard_selectColor": "Wybierz kolor",
  "newCard_scannedSuccessfully": "Pomyślnie zeskanowano: ",
  "newCard_addedSuccessfully": "Pomyślnie dodano!",
  "newCard_errorAdding": "Wystąpił błąd, spróbuj ponownie!",
  "newCard_missingInformation": "Wpisz nazwę sklepu i zeskanuj kartę!",

  "privacy.line_1": "<strong>Niniejsza polityka prywatności oraz informacje są dostępne w języku angielskim i innych językach.</strong>",
  "privacy.line_2": "<strong>Zawsze będzie wyświetlana w języku Twojego urządzenia, o ile go obsługujemy.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Polityka prywatności dla strony internetowej/aplikacji</strong> <br /><br />",
  "privacy.line_4": "Dziękujemy za odwiedzenie naszej strony internetowej/aplikacji. Przywiązujemy dużą wagę do ochrony Twoich danych i chcemy przedstawić Ci w niniejszej polityce prywatności przegląd tego, jak przetwarzamy Twoje dane zgodnie z Ogólnym Rozporządzeniem o Ochronie Danych (RODO), europejskimi przepisami o ochronie danych, Kalifornijską Ustawą o Ochronie Prywatności Konsumentów (CCPA) oraz prawem stanu Kalifornia. <br /> <br />",
  "privacy.line_5": "<strong>1. Administrator danych</strong><br />",
  "privacy.line_6": "Administratorem Twoich danych i wydawcą tej aplikacji jest: <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Kontakt telefoniczny: +49 176 21674883 <br />",
  "privacy.line_11": "Dyrektor/Właściciel: Christian Scheub <br />",
  "privacy.line_12": "W przypadku pytań lub wątpliwości dotyczących ochrony danych, prosimy o kontakt pod adresem christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Link do impressum: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Pliki cookie, IndexedDB i podobne technologie</strong><br />",
  "privacy.line_15": "Używamy plików cookie i podobnych technologii, aby oferować Ci spersonalizowane reklamy i poprawić wydajność naszej strony internetowej/aplikacji. Obejmuje to pliki cookie przechowywane na Twoim urządzeniu. Technologie te pomagają nam zapamiętać Twoje preferencje i zoptymalizować doświadczenia użytkownika. <br />",
  "privacy.line_16": "Ponadto używamy lokalnej bazy danych IndexedDB do lokalnego przechowywania kart klientów. Twoje karty klientów zawsze pozostają lokalne. <br />",
  "privacy.line_17": "IndexedDB to czysto lokalna baza danych SQL w przeglądarce, którą można sobie wyobrazić jako dużą tabelę, w której przechowujemy Twoje dane. <br /> <br />",
  "privacy.line_18": "<strong>3. Gromadzenie i przetwarzanie danych przez AdMob i AdSense</strong><br />",
  "privacy.line_19": "Używamy AdMob i AdSense, aby wyświetlać Ci spersonalizowane reklamy. Usługi te mogą używać plików cookie i podobnych technologii do zbierania danych o Twoim korzystaniu ze strony internetowej/aplikacji i dostarczania dopasowanych reklam. Dane zbierane przez te usługi mogą obejmować:",
  "privacy.line_20": "- Twój adres IP",
  "privacy.line_21": "- Informacje o Twoich interakcjach ze stroną internetową/aplikacją",
  "privacy.line_22": "- Informacje specyficzne dla urządzenia",
  "privacy.line_23": "Zebrane dane są przetwarzane zgodnie z politykami prywatności Google. Więcej informacji można znaleźć w politykach prywatności Google AdMob i Google AdSense. <br /> <br />Aby uzyskać Twoją zgodę na spersonalizowane reklamy, korzystamy z <strong>Google User Messaging Platform (UMP)</strong>, która opiera się na <strong>Transparency and Consent Framework (TCF) Wersja 2.2</strong> organizacji <strong>IAB Europe</strong>. Przy pierwszym uruchomieniu aplikacji lub po wygaśnięciu Twojej poprzedniej decyzji, zostanie wyświetlone zapytanie o zgodę, które pozwoli Ci określić, czy i w jakim zakresie zgadzasz się na przetwarzanie danych. Zebrane zgody dotyczą m.in. spersonalizowanych reklam, pomiarów i udostępniania danych stronom trzecim. Twój wybór jest przechowywany lokalnie i może być w każdej chwili odwołany lub zmieniony. <br /> <br />",
  "privacy.line_24": "<strong>4. Sprzedaż danych</strong><br />",
  "privacy.line_25": "Nie sprzedajemy żadnych Twoich danych. Dane zbierane przez AdMob i AdSense podlegają politykom prywatności odpowiednich dostawców. <br /> <br />",
  "privacy.line_26": "<strong>5. Twoje prawa</strong><br />",
  "privacy.line_27": "Masz prawo żądać informacji o przechowywanych danych na Twój temat, żądać ich poprawienia lub usunięcia, a także ograniczenia przetwarzania. Ponieważ nie przechowujemy własnych danych, prawa te dotyczą danych zbieranych przez AdMob i AdSense. Prosimy o kontakt z odpowiednimi dostawcami w celu uzyskania dalszych informacji i skorzystania z Twoich praw. <br /> <br />",
  "privacy.line_28": "<strong>6. Bezpieczeństwo danych</strong><br />",
  "privacy.line_29": "Dokładamy starań, aby chronić Twoje dane poprzez odpowiednie środki techniczne i organizacyjne. Bezpieczeństwo Twoich danych jest dla nas ważne, i stosujemy środki bezpieczeństwa zgodnie z wymogami prawnymi. <br /> <br />",
  "privacy.line_30": "<strong>7. Używane pojęcia</strong><br />",
  "privacy.line_31": "Dane osobowe to informacje odnoszące się do zidentyfikowanej lub możliwej do zidentyfikowania osoby fizycznej. W tym kontekście dane osobowe mogą być zbierane i przetwarzane przez AdMob i AdSense. <br /> <br />",
  "privacy.line_32": "<strong>8. Zmiany w niniejszej polityce prywatności</strong><br />",
  "privacy.line_33": "Zastrzegamy sobie prawo do zmiany niniejszej polityki prywatności w celu dostosowania jej do wymogów prawnych lub odzwierciedlenia zmian w naszych praktykach przetwarzania danych. Prosimy o regularne sprawdzanie tego oświadczenia, aby być na bieżąco. <br />",
  "privacy.line_34": "Data: 03.05.2025 <br /> <br />",
  "privacy.update_2025_05": "Nasza polityka prywatności została zaktualizowana. Obecnie wyraźnie informujemy, że korzystamy z okna dialogowego zgody Google AdMob (User Messaging Platform) w celu uzyskania Twojej zgody na przetwarzanie danych. Prosimy o zapoznanie się z zaktualizowaną polityką prywatności."
}
