{
  "settings_Title": "Configuración",
  "settings_DeleteAll": "Eliminar todos los datos locales",
  "settings_DeleteUserAndData": "Eliminar usuario",
  "settings_DeleteUserConfirmDialog": "¿Estás seguro de que deseas eliminar tu usuario?",
  "settings_DeleteUserErrorContactAdmin": "Lamentablemente, ocurrió un error. Por favor, cierra sesión e inicia sesión nuevamente. De lo contrario, contáctanos según nuestro aviso legal.",
  "settings_EmailPasswordRequiredToDelete": "¡Debes iniciar sesión aquí para eliminar tu cuenta!",
  "settings_Information": "Información",
  "settings_Datenschutz": "Política de privacidad",
  "settings_Impressum": "Aviso legal",
  "settings_GitHubRepo": "Repositorio de GitHub",
  "setting_Menu_OpenSourceModulList": "Bibliotecas utilizadas",
  "setting_OpenSurceModulListTItle": "Bibliotecas NPM utilizadas",
  "setting_OpenSourceModulListClose": "Cerrar",
  "settings_Dialog_DeleteAllSuccessful": "Todos los datos han sido eliminados con éxito. ¡Reinicia la aplicación para evitar que se guarden nuevos datos!",
  "settings_Dialog_DeleteAll": "¿Estás seguro de que deseas eliminar todas las entradas?",
  "navbar_searchForm": "Buscar tarjeta...",
  "noCardsThere": "Aún no hay tarjetas... Haz clic en el botón más para agregar",
  "newCard_Title": "Nueva tarjeta de cliente",
  "newCard_shopForm": "Introduce el nombre de la tienda",
  "newCard_selectColor": "Seleccionar color",
  "newCard_scannedSuccessfully": "Escaneado con éxito: ",
  "newCard_addedSuccessfully": "¡Añadido con éxito!",
  "newCard_errorAdding": "Ocurrió un error, ¡inténtalo de nuevo!",
  "newCard_missingInformation": "¡Por favor, introduce el nombre de la tienda y escanea una tarjeta!",

  "privacy.line_1": "<strong>Esta política de privacidad y la información están disponibles en inglés y otros idiomas.</strong>",
  "privacy.line_2": "<strong>Siempre se mostrará en el idioma de su dispositivo, siempre que lo admitamos.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Política de privacidad para el sitio web/aplicación</strong> <br /><br />",
  "privacy.line_4": "Gracias por visitar nuestro sitio web/aplicación. Valoramos mucho la protección de sus datos y, con esta política de privacidad, queremos brindarle una visión general de cómo tratamos sus datos de acuerdo con el Reglamento General de Protección de Datos (RGPD), las leyes europeas de protección de datos, así como la Ley de Privacidad del Consumidor de California (CCPA) y la legislación de California. <br /> <br />",
  "privacy.line_5": "<strong>1. Responsable</strong><br />",
  "privacy.line_6": "El responsable del tratamiento de sus datos y editor de esta aplicación es: <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Teléfono de contacto: +49 176 21674883 <br />",
  "privacy.line_11": "Director general/Propietario: Christian Scheub <br />",
  "privacy.line_12": "Si tiene preguntas o inquietudes sobre la privacidad, no dude en contactarnos en christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Enlace al aviso legal: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Cookies, IndexedDB y tecnologías similares</strong><br />",
  "privacy.line_15": "Utilizamos cookies y tecnologías similares para ofrecerle publicidad personalizada y mejorar el rendimiento de nuestro sitio web/aplicación. Esto incluye cookies que se almacenan en su dispositivo. Estas tecnologías nos ayudan a guardar sus preferencias y optimizar la experiencia del usuario. <br />",
  "privacy.line_16": "También utilizamos una IndexedDB local para almacenar las tarjetas de cliente localmente. Sin embargo, sus tarjetas de cliente siempre permanecen locales. <br />",
  "privacy.line_17": "Una IndexedDB es una base de datos SQL puramente local en el navegador que puede imaginarse como una gran tabla en la que almacenamos sus datos. <br /> <br />",
  "privacy.line_18": "<strong>3. Recopilación y procesamiento de datos por AdMob y AdSense</strong><br />",
  "privacy.line_19": "Utilizamos AdMob y AdSense para mostrarle publicidad personalizada. Estos servicios utilizan cookies y tecnologías similares para recopilar datos sobre su uso del sitio web/aplicación y ofrecer publicidad personalizada. Los datos recopilados por estos servicios pueden incluir:",
  "privacy.line_20": "- Su dirección IP",
  "privacy.line_21": "- Información sobre sus interacciones con el sitio web/aplicación",
  "privacy.line_22": "- Información específica del dispositivo",
  "privacy.line_23": "Los datos recopilados se procesan de acuerdo con las políticas de privacidad de Google. Para obtener más información, consulte las políticas de privacidad de <a href=\"https://support.google.com/admob/answer/6128543\">Google AdMob</a> y <a href=\"https://support.google.com/adsense/answer/7007310\">Google AdSense</a>. <br /> <br />",
  "privacy.line_24": "<strong>4. Venta de datos</strong><br />",
  "privacy.line_25": "No vendemos ninguno de sus datos. Los datos recopilados por AdMob y AdSense están sujetos a las políticas de privacidad de los respectivos proveedores. <br /> <br />",
  "privacy.line_26": "<strong>5. Sus derechos</strong><br />",
  "privacy.line_27": "Tiene derecho a solicitar información sobre los datos almacenados sobre usted, solicitar su corrección o eliminación, así como restringir el procesamiento. Dado que no almacenamos datos propios, estos derechos se refieren a los datos recopilados por AdMob y AdSense. Por favor, contacte a los respectivos proveedores para obtener más información y ejercer sus derechos. <br /> <br />",
  "privacy.line_28": "<strong>6. Seguridad de los datos</strong><br />",
  "privacy.line_29": "Nos esforzamos por proteger sus datos mediante medidas técnicas y organizativas adecuadas. La seguridad de sus datos es importante para nosotros, y utilizamos medidas de seguridad de acuerdo con los requisitos legales. <br /> <br />",
  "privacy.line_30": "<strong>7. Términos utilizados</strong><br />",
  "privacy.line_31": "Los datos personales son información que se refiere a una persona física identificada o identificable. En este contexto, los datos personales pueden ser recopilados y procesados por AdMob y AdSense. <br /> <br />",
  "privacy.line_32": "<strong>8. Cambios en esta política de privacidad</strong><br />",
  "privacy.line_33": "Nos reservamos el derecho de cambiar esta política de privacidad para cumplir con los requisitos legales o reflejar cambios en nuestras prácticas de procesamiento de datos. Por favor, revise esta declaración regularmente para mantenerse informado. <br />",
  "privacy.line_34": "Fecha: 09.03.2025 <br /> <br />"
}
