{
  "settings_Title": "Inställningar",
  "settings_DeleteAll": "Ta bort all lokal data",
  "settings_DeleteUserAndData": "Ta bort användare",
  "settings_DeleteUserConfirmDialog": "Är du säker på att du vill ta bort användaren?",
  "settings_DeleteUserErrorContactAdmin": "Ett fel uppstod. Logga ut och logga in igen. Om problemet kvarstår, kontakta oss via den juridiska informationen.",
  "settings_EmailPasswordRequiredToDelete": "Du måste vara inloggad för att ta bort ditt konto!",
  "settings_Information": "Information",
  "settings_Datenschutz": "Integritetspolicy",
  "settings_Impressum": "Juridisk information",
  "settings_GitHubRepo": "GitHub-repository",
  "setting_Menu_OpenSourceModulList": "Använda bibliotek",
  "setting_OpenSurceModulListTItle": "Använda NPM-bibliotek",
  "setting_OpenSourceModulListClose": "Stäng",
  "settings_Dialog_DeleteAllSuccessful": "All data har tagits bort. Starta om appen för att förhindra att ny data sparas!",
  "settings_Dialog_DeleteAll": "Är du säker på att du vill ta bort alla poster?",
  "navbar_searchForm": "Sök efter kort...",
  "noCardsThere": "Inga kort ännu... Tryck på plusknappen för att lägga till ett!",
  "newCard_Title": "Nytt kundkort",
  "newCard_shopForm": "Ange butikens namn",
  "newCard_selectColor": "Välj färg",
  "newCard_scannedSuccessfully": "Skannat framgångsrikt: ",
  "newCard_addedSuccessfully": "Lagt till framgångsrikt!",
  "newCard_errorAdding": "Ett fel uppstod, försök igen!",
  "newCard_missingInformation": "Ange butikens namn och skanna ett kort!",

  "privacy.line_1": "<strong>Denna integritetspolicy och information finns tillgänglig på engelska och andra språk.</strong>",
  "privacy.line_2": "<strong>Den visas alltid på ditt enhets språk, förutsatt att vi stöder det.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Integritetspolicy för webbplats/app</strong> <br /><br />",
  "privacy.line_4": "Tack för att du besöker vår webbplats/app. Vi lägger stor vikt vid skyddet av dina uppgifter och vill med denna integritetspolicy ge dig en översikt över hur vi behandlar dina uppgifter i enlighet med dataskyddsförordningen (GDPR), europeiska dataskyddslagar samt California Consumer Privacy Act (CCPA) och kalifornisk lagstiftning. <br /> <br />",
  "privacy.line_5": "<strong>1. Ansvarig enhet</strong><br />",
  "privacy.line_6": "Ansvarig för behandlingen av dina uppgifter och utgivare av denna app är: <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Kontakttelefon: +49 176 21674883 <br />",
  "privacy.line_11": "Verkställande direktör/ägare: Christian Scheub <br />",
  "privacy.line_12": "Vid frågor eller funderingar kring dataskydd är du välkommen att kontakta oss på christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Länk till impressum: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Cookies, IndexedDB och liknande teknologier</strong><br />",
  "privacy.line_15": "Vi använder cookies och liknande teknologier för att erbjuda dig personligt anpassad reklam och förbättra prestandan på vår webbplats/app. Detta inkluderar cookies som lagras på din enhet. Dessa teknologier hjälper oss att spara dina preferenser och optimera användarupplevelsen. <br />",
  "privacy.line_16": "Dessutom använder vi en lokal IndexedDB för att lagra kundkort lokalt. Dina kundkort förblir dock alltid lokala. <br />",
  "privacy.line_17": "En IndexedDB är en helt lokal SQL-databas i webbläsaren som du kan föreställa dig som en stor tabell där vi lagrar dina uppgifter. <br /> <br />",
  "privacy.line_18": "<strong>3. Insamling och behandling av data genom AdMob och AdSense</strong><br />",
  "privacy.line_19": "Vi använder AdMob och AdSense för att visa dig personligt anpassad reklam. Dessa tjänster använder cookies och liknande teknologier för att samla in data om din användning av webbplatsen/appen och erbjuda skräddarsydd reklam. De data som samlas in av dessa tjänster kan inkludera:",
  "privacy.line_20": "- Din IP-adress",
  "privacy.line_21": "- Information om dina interaktioner med webbplatsen/appen",
  "privacy.line_22": "- Enhetsspecifik information",
  "privacy.line_23": "De insamlade uppgifterna behandlas i enlighet med Googles integritetspolicyer. För mer information, vänligen se integritetspolicyerna för <a href=\"https://support.google.com/admob/answer/6128543\">Google AdMob</a> och <a href=\"https://support.google.com/adsense/answer/7007310\">Google AdSense</a>. <br /> <br />",
  "privacy.line_24": "<strong>4. Försäljning av data</strong><br />",
  "privacy.line_25": "Vi säljer inte dina uppgifter. De data som samlas in av AdMob och AdSense omfattas av respektive leverantörers integritetspolicyer. <br /> <br />",
  "privacy.line_26": "<strong>5. Dina rättigheter</strong><br />",
  "privacy.line_27": "Du har rätt att begära information om de uppgifter som lagras om dig, begära rättelse eller radering av dessa samt begränsa behandlingen. Eftersom vi inte lagrar egna uppgifter, avser dessa rättigheter de uppgifter som samlas in av AdMob och AdSense. Vänligen kontakta respektive leverantör för mer information och för att utöva dina rättigheter. <br /> <br />",
  "privacy.line_28": "<strong>6. Datasäkerhet</strong><br />",
  "privacy.line_29": "Vi strävar efter att skydda dina uppgifter genom lämpliga tekniska och organisatoriska åtgärder. Säkerheten för dina uppgifter är viktig för oss, och vi använder säkerhetsrelaterade åtgärder i enlighet med lagkrav. <br /> <br />",
  "privacy.line_30": "<strong>7. Använda begrepp</strong><br />",
  "privacy.line_31": "Personuppgifter är information som rör en identifierad eller identifierbar fysisk person. I detta sammanhang kan personuppgifter samlas in och behandlas av AdMob och AdSense. <br /> <br />",
  "privacy.line_32": "<strong>8. Ändringar av denna integritetspolicy</strong><br />",
  "privacy.line_33": "Vi förbehåller oss rätten att ändra denna integritetspolicy för att uppfylla lagkrav eller för att återspegla ändringar i våra databehandlingsrutiner. Vänligen granska denna policy regelbundet för att hålla dig informerad. <br />",
  "privacy.line_34": "Datum: 2025-03-09 <br /> <br />"
}
