{
  "settings_Title": "Instellingen",
  "settings_DeleteAll": "Alle lokale gegevens verwijderen",
  "settings_DeleteUserAndData": "Gebruiker verwijderen",
  "settings_DeleteUserConfirmDialog": "Weet u zeker dat u uw gebruiker wilt verwijderen?",
  "settings_DeleteUserErrorContactAdmin": "Er is een fout opgetreden. Log uit en log opnieuw in. Als het probleem zich blijft voordoen, neem dan contact met ons op via de juridische kennisgeving.",
  "settings_EmailPasswordRequiredToDelete": "U moet inloggen om uw account te verwijderen!",
  "settings_Information": "Informatie",
  "settings_Datenschutz": "Privacybeleid",
  "settings_Impressum": "Juridische kennisgeving",
  "settings_GitHubRepo": "GitHub-repository",
  "setting_Menu_OpenSourceModulList": "Gebruikte bibliotheken",
  "setting_OpenSurceModulListTItle": "Gebruikte NPM-bibliotheken",
  "setting_OpenSourceModulListClose": "Sluiten",
  "settings_Dialog_DeleteAllSuccessful": "Alle gegevens zijn succesvol verwijderd. Start de applicatie opnieuw om te voorkomen dat er nieuwe gegevens worden opgeslagen!",
  "settings_Dialog_DeleteAll": "Weet u zeker dat u alle vermeldingen wilt verwijderen?",
  "navbar_searchForm": "Zoek een kaart...",
  "noCardsThere": "Nog geen kaarten... Druk op de plusknop om er een toe te voegen!",
  "newCard_Title": "Nieuwe klantenkaart",
  "newCard_shopForm": "Voer de winkelnaam in",
  "newCard_selectColor": "Kies een kleur",
  "newCard_scannedSuccessfully": "Succesvol gescand: ",
  "newCard_addedSuccessfully": "Succesvol toegevoegd!",
  "newCard_errorAdding": "Er is een fout opgetreden, probeer het opnieuw!",
  "newCard_missingInformation": "Voer de winkelnaam in en scan een kaart!",

  "privacy.line_1": "<strong>Dit privacybeleid en de informatie zijn beschikbaar in het Engels en andere talen.</strong>",
  "privacy.line_2": "<strong>Het wordt altijd weergegeven in de taal van uw apparaat, indien ondersteund.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Privacybeleid voor website/app</strong> <br /><br />",
  "privacy.line_4": "Bedankt voor uw bezoek aan onze website/app. Wij hechten veel waarde aan de bescherming van uw gegevens en willen u met dit privacybeleid een overzicht geven van hoe wij uw gegevens behandelen in overeenstemming met de Algemene Verordening Gegevensbescherming (AVG), de Europese privacywetgeving, de California Consumer Privacy Act (CCPA) en de Californische wetgeving. <br /> <br />",
  "privacy.line_5": "<strong>1. Verantwoordelijke instantie</strong><br />",
  "privacy.line_6": "Verantwoordelijk voor de verwerking van uw gegevens en uitgever van deze app is: <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Contact telefoon: +49 176 21674883 <br />",
  "privacy.line_11": "Directeur/eigenaar: Christian Scheub <br />",
  "privacy.line_12": "Voor vragen of opmerkingen over privacy kunt u contact met ons opnemen via christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Link naar het impressum: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Cookies, IndexedDB en vergelijkbare technologieën</strong><br />",
  "privacy.line_15": "Wij gebruiken cookies en vergelijkbare technologieën om u gepersonaliseerde advertenties aan te bieden en de prestaties van onze website/app te verbeteren. Dit omvat cookies die op uw apparaat worden opgeslagen. Deze technologieën helpen ons uw voorkeuren op te slaan en de gebruikerservaring te optimaliseren. <br />",
  "privacy.line_16": "Daarnaast gebruiken wij een lokale IndexedDB om klantenkaarten lokaal op te slaan. Uw klantenkaarten blijven echter altijd lokaal. <br />",
  "privacy.line_17": "Een IndexedDB is een puur lokale SQL-database in de browser die u zich kunt voorstellen als een grote tabel waarin wij uw gegevens opslaan. <br /> <br />",
  "privacy.line_18": "<strong>3. Verzameling en verwerking van gegevens door AdMob en AdSense</strong><br />",
  "privacy.line_19": "Wij gebruiken AdMob en AdSense om u gepersonaliseerde advertenties te tonen. Deze diensten gebruiken cookies en vergelijkbare technologieën om gegevens over uw gebruik van de website/app te verzamelen en op maat gemaakte advertenties aan te bieden. De door deze diensten verzamelde gegevens kunnen het volgende omvatten:",
  "privacy.line_20": "- Uw IP-adres",
  "privacy.line_21": "- Informatie over uw interacties met de website/app",
  "privacy.line_22": "- Apparaatspecifieke informatie",
  "privacy.line_23": "De verzamelde gegevens worden verwerkt in overeenstemming met het privacybeleid van Google. Meer informatie vindt u in het privacybeleid van <a href=\"https://support.google.com/admob/answer/6128543\">Google AdMob</a> en <a href=\"https://support.google.com/adsense/answer/7007310\">Google AdSense</a>. <br /> <br />",
  "privacy.line_24": "<strong>4. Verkoop van gegevens</strong><br />",
  "privacy.line_25": "Wij verkopen geen van uw gegevens. De door AdMob en AdSense verzamelde gegevens vallen onder het privacybeleid van de respectieve aanbieders. <br /> <br />",
  "privacy.line_26": "<strong>5. Uw rechten</strong><br />",
  "privacy.line_27": "U heeft het recht om informatie op te vragen over de gegevens die over u zijn opgeslagen, om correctie of verwijdering ervan te verzoeken en om de verwerking te beperken. Aangezien wij zelf geen gegevens opslaan, hebben deze rechten betrekking op de gegevens die door AdMob en AdSense worden verzameld. Neem contact op met de respectieve aanbieders voor meer informatie en om uw rechten uit te oefenen. <br /> <br />",
  "privacy.line_28": "<strong>6. Gegevensbeveiliging</strong><br />",
  "privacy.line_29": "Wij doen ons best om uw gegevens te beschermen door middel van passende technische en organisatorische maatregelen. De veiligheid van uw gegevens is belangrijk voor ons, en wij gebruiken beveiligingsmaatregelen in overeenstemming met de wettelijke vereisten. <br /> <br />",
  "privacy.line_30": "<strong>7. Gebruikte terminologie</strong><br />",
  "privacy.line_31": "Persoonsgegevens zijn informatie die betrekking heeft op een geïdentificeerde of identificeerbare natuurlijke persoon. In dit verband kunnen persoonsgegevens worden verzameld en verwerkt door AdMob en AdSense. <br /> <br />",
  "privacy.line_32": "<strong>8. Wijzigingen in dit privacybeleid</strong><br />",
  "privacy.line_33": "Wij behouden ons het recht voor om dit privacybeleid te wijzigen om te voldoen aan wettelijke vereisten of om wijzigingen in onze gegevensverwerkingspraktijken weer te geven. Controleer dit beleid regelmatig om op de hoogte te blijven. <br />",
  "privacy.line_34": "Datum: 09-03-2025 <br /> <br />"
}
