{
  "settings_Title": "Indstillinger",
  "settings_DeleteAll": "Slet alle lokale data",
  "settings_DeleteUserAndData": "Slet bruger",
  "settings_DeleteUserConfirmDialog": "Er du sikker på, at du vil slette din bruger?",
  "settings_DeleteUserErrorContactAdmin": "Der opstod desværre en fejl. Log venligst ud og log ind igen. Ellers bedes du kontakte os i henhold til vores juridiske meddelelse.",
  "settings_EmailPasswordRequiredToDelete": "Du skal logge ind her for at slette din konto!",
  "settings_Information": "Information",
  "settings_Datenschutz": "Privatlivspolitik",
  "settings_Impressum": "Juridisk meddelelse",
  "settings_GitHubRepo": "GitHub-repository",
  "setting_Menu_OpenSourceModulList": "Brugte biblioteker",
  "setting_OpenSurceModulListTItle": "Brugte NPM-biblioteker",
  "setting_OpenSourceModulListClose": "Luk",
  "settings_Dialog_DeleteAllSuccessful": "Alle data er blevet slettet. Genstart venligst applikationen, så der ikke gemmes nye data!",
  "settings_Dialog_DeleteAll": "Er du sikker på, at du vil slette alle poster?",
  "navbar_searchForm": "Søg efter kort...",
  "noCardsThere": "Ingen kort endnu... Klik på plus for at tilføje",
  "newCard_Title": "Nyt kundekort",
  "newCard_shopForm": "Indtast butikkens navn",
  "newCard_selectColor": "Vælg farve",
  "newCard_scannedSuccessfully": "Scannet med succes: ",
  "newCard_addedSuccessfully": "Tilføjet med succes!",
  "newCard_errorAdding": "Der opstod en fejl, prøv venligst igen!",
  "newCard_missingInformation": "Indtast venligst butikkens navn og scan et kort!",

  "privacy.line_1": "<strong>Denne fortrolighedspolitik og oplysningerne er tilgængelige på engelsk og andre sprog.</strong>",
  "privacy.line_2": "<strong>Den vises altid på dit enheds sprog, hvis vi understøtter det.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Fortrolighedspolitik for hjemmeside/app</strong> <br /><br />",
  "privacy.line_4": "Tak for dit besøg på vores hjemmeside/app. Vi lægger stor vægt på beskyttelsen af dine data og ønsker med denne fortrolighedspolitik at give dig et overblik over, hvordan vi behandler dine data i overensstemmelse med databeskyttelsesforordningen (GDPR), europæiske databeskyttelseslove samt California Consumer Privacy Act (CCPA) og californisk lovgivning. <br /> <br />",
  "privacy.line_5": "<strong>1. Ansvarlig enhed</strong><br />",
  "privacy.line_6": "Ansvarlig for behandlingen af dine data og udgiver af denne app er: <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Kontakt telefon: +49 176 21674883 <br />",
  "privacy.line_11": "Administrerende direktør/indehaver: Christian Scheub <br />",
  "privacy.line_12": "Hvis du har spørgsmål eller bekymringer vedrørende databeskyttelse, er du velkommen til at kontakte os på christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Link til impressum: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Cookies, IndexedDB og lignende teknologier</strong><br />",
  "privacy.line_15": "Vi bruger cookies og lignende teknologier for at tilbyde dig personlig reklame og forbedre ydeevnen på vores hjemmeside/app. Disse teknologier inkluderer cookies, der gemmes på din enhed. De hjælper os med at gemme dine præferencer og optimere brugeroplevelsen. <br />",
  "privacy.line_16": "Vi bruger også en lokal IndexedDB til at gemme kundekortene lokalt. Dine kundekort forbliver dog altid lokale. <br />",
  "privacy.line_17": "En IndexedDB er en rent lokal SQL-database i browseren, som du kan forestille dig som en stor tabel, hvor vi gemmer dine data. <br /> <br />",
  "privacy.line_18": "<strong>3. Indsamling og behandling af data via AdMob og AdSense</strong><br />",
  "privacy.line_19": "Vi bruger AdMob og AdSense til at vise dig personlig reklame. Disse tjenester bruger cookies og lignende teknologier til at indsamle data om din brug af hjemmesiden/appen og tilbyde skræddersyet reklame. De data, der indsamles af disse tjenester, kan omfatte:",
  "privacy.line_20": "- Din IP-adresse",
  "privacy.line_21": "- Oplysninger om dine interaktioner med hjemmesiden/appen",
  "privacy.line_22": "- Enhedsspecifikke oplysninger",
  "privacy.line_23": "De indsamlede data behandles i overensstemmelse med Googles privatlivspolitikker. For mere information, se venligst <a href=\"https://support.google.com/admob/answer/6128543\">Google AdMob</a> og <a href=\"https://support.google.com/adsense/answer/7007310\">Google AdSense</a>. <br /> <br />",
  "privacy.line_24": "<strong>4. Salg af data</strong><br />",
  "privacy.line_25": "Vi sælger ikke dine data. De data, der indsamles af AdMob og AdSense, er underlagt de respektive udbyderes privatlivspolitikker. <br /> <br />",
  "privacy.line_26": "<strong>5. Dine rettigheder</strong><br />",
  "privacy.line_27": "Du har ret til at anmode om oplysninger om de data, der er gemt om dig, anmode om rettelse eller sletning samt begrænse behandlingen. Da vi ikke gemmer egne data, vedrører disse rettigheder de data, der indsamles af AdMob og AdSense. Kontakt venligst de respektive udbydere for mere information og for at udøve dine rettigheder. <br /> <br />",
  "privacy.line_28": "<strong>6. Datasikkerhed</strong><br />",
  "privacy.line_29": "Vi bestræber os på at beskytte dine data gennem passende tekniske og organisatoriske foranstaltninger. Sikkerheden af dine data er vigtig for os, og vi bruger sikkerhedsrelaterede foranstaltninger i overensstemmelse med lovkravene. <br /> <br />",
  "privacy.line_30": "<strong>7. Anvendte begreber</strong><br />",
  "privacy.line_31": "Personoplysninger er oplysninger, der vedrører en identificeret eller identificerbar fysisk person. I denne sammenhæng kan personoplysninger indsamles og behandles af AdMob og AdSense. <br /> <br />",
  "privacy.line_32": "<strong>8. Ændringer i denne fortrolighedspolitik</strong><br />",
  "privacy.line_33": "Vi forbeholder os retten til at ændre denne fortrolighedspolitik for at overholde lovkrav eller afspejle ændringer i vores databehandlingspraksis. Tjek venligst denne erklæring regelmæssigt for at holde dig opdateret. <br />",
  "privacy.line_34": "Dato: 09.03.2025 <br /> <br />"
}
