{
  "settings_Title": "Einstellungen",
  "settings_DeleteAll": "Alle lokalen Daten löschen",
  "settings_DeleteUserAndData": "Nutzer löschen",
  "settings_DeleteUserConfirmDialog": "Sind sie sicher das sie ihren User löschen möchten?",
  "settings_DeleteUserErrorContactAdmin": "Leider ist ein Fehler aufgetreten. Loggen sie sich bitte aus und erneut ein. Ansonsten kontaktieren sie uns bitte gemäß unseres Impressums.",
  "settings_EmailPasswordRequiredToDelete": "Sie müssen sich hier einloggen um ihren Account zu löschen!",
  "settings_Information": "Informationen",
  "settings_Datenschutz": "Datenschutz",
  "settings_Impressum": "Impressum",
  "settings_GitHubRepo": "GitHub-Repository",
  "setting_Menu_OpenSourceModulList": "Verwendete Bibliotheken",
  "setting_OpenSurceModulListTItle": "Verwendete NPM-Bibliotheken",
  "setting_OpenSourceModulListClose": "Schließen",
  "settings_Dialog_DeleteAllSuccessful": "Alle Daten wurden erfolgreich gelöscht. Bitte starten Sie die Anwendung neu, damit keine neuen Daten gespeichert werden!",
  "settings_Dialog_DeleteAll": "Sind Sie sicher, dass Sie alle Einträge löschen möchten?",

  "navbar_searchForm": "Karte suchen...",
  "noCardsThere": "Noch keine Karte hier... Klicken sie das Plus zum hinzufügen!",

  "newCard_Title": "Neue Kundenkarte",
  "newCard_shopForm": "Geben Sie den Shop-Name ein",
  "newCard_selectColor": "Farbe auswählen",
  "newCard_scannedSuccessfully": "Erfolgreich gescannt: ",
  "newCard_addedSuccessfully": "Erfolgreich hinzugefügt!",
  "newCard_errorAdding": "Es ist ein Fehler aufgetreten, bitte erneut versuchen!",
  "newCard_missingInformation": "Bitte geben sie den Shop Name ein und Scannen sie eine Karte!",

  "privacy.line_1": "<strong>Diese Datenschutzerklärung und die Informationen sind in Englisch und anderen Sprachen verfügbar. </strong>",
  "privacy.line_2": "<strong>Sie wird immer angezeigt an die Sprache ihres Gerätes sofern wir die unterstützen.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Datenschutzerklärung für Webseite/App</strong> <br /><br />",
  "privacy.line_4": "Vielen Dank für Ihren Besuch auf unserer Webseite/App. Wir legen großen Wert auf den Schutz Ihrer Daten und möchten Ihnen mit dieser Datenschutzerklärung einen Überblick darüber geben, wie wir Ihre Daten gemäß der Datenschutz-Grundverordnung (DSGVO), den europäischen Datenschutzgesetzen sowie dem California Consumer Privacy Act (CCPA) und kalifornischem Recht behandeln. <br /> <br />",
  "privacy.line_5": "<strong>1. Verantwortliche Stelle</strong><br />",
  "privacy.line_6": "Verantwortlich für die Verarbeitung Ihrer Daten und Herausgeber dieser App ist: <br />",
  "privacy.line_7": "Christian Scheub <br />",
  "privacy.line_8": "Ziegeläcker 56 <br />",
  "privacy.line_9": "71560 Sulzbach an der Murr <br /> <br />",
  "privacy.line_10": "Kontakt Telefon: +49 176 21674883 <br />",
  "privacy.line_11": "Geschäftsführer/Inhaber: Christian Scheub <br />",
  "privacy.line_12": "Bei Fragen oder Anliegen zum Datenschutz können Sie uns gerne unter christian.developer.app@gmail.com kontaktieren. <br />",
  "privacy.line_13": "Link zum Impressum: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Cookies, IndexedDB und ähnliche Technologien</strong><br />",
  "privacy.line_15": "Wir verwenden Cookies und ähnliche Technologien, um Ihnen personalisierte Werbung anzubieten und die Leistung unserer Webseite/App zu verbessern. Dazu gehören Cookies, die auf Ihrem Gerät gespeichert werden. Diese Technologien helfen uns, Ihre Präferenzen zu speichern und die Benutzererfahrung zu optimieren. <br />",
  "privacy.line_16": "Zudem nutzen wir zur lokalen Speicherung der Kundenkarten eine lokale IndexedDB. Ihre Kundenkarten bleiben aber immer lokal. <br />",
  "privacy.line_17": "Eine IndexedDB ist eine rein lokale SQL Datenbank im Browser welche sie sich vorstellen können wie eine große Tabelle in welcher wir ihre Daten speichern. <br /> <br />",
  "privacy.line_18": "<strong>3. Erhebung und Verarbeitung von Daten durch AdMob und AdSense</strong><br />",
  "privacy.line_19": "Wir nutzen AdMob und AdSense, um Ihnen personalisierte Werbung anzuzeigen. Diese Dienste verwenden Cookies und ähnliche Technologien, um Daten über Ihre Nutzung der Webseite/App zu sammeln und maßgeschneiderte Werbung anzubieten. Die von diesen Diensten gesammelten Daten können Folgendes umfassen:",
  "privacy.line_20": "- Ihre IP-Adresse",
  "privacy.line_21": "- Informationen über Ihre Interaktionen mit der Webseite/App",
  "privacy.line_22": "- Gerätespezifische Informationen",
  "privacy.line_23": "Die gesammelten Daten werden gemäß den Datenschutzrichtlinien von Google verarbeitet. Weitere Informationen finden Sie in den Datenschutzrichtlinien von <a href=\"https://support.google.com/admob/answer/6128543\">Google AdMob</a> und <a href=\"https://support.google.com/adsense/answer/7007310\">Google AdSense</a>. <br /> <br />",
  "privacy.line_24": "<strong>4. Verkauf von Daten</strong><br />",
  "privacy.line_25": "Wir verkaufen keine Ihrer Daten. Die von AdMob und AdSense gesammelten Daten unterliegen den Datenschutzrichtlinien der jeweiligen Anbieter. <br /> <br />",
  "privacy.line_26": "<strong>5. Ihre Rechte</strong><br />",
  "privacy.line_27": "Sie haben das Recht, Auskunft über die von Ihnen gespeicherten Daten zu verlangen, deren Berichtigung oder Löschung zu verlangen sowie die Verarbeitung einzuschränken. Da wir keine eigenen Daten speichern, beziehen sich diese Rechte auf die Daten, die durch AdMob und AdSense gesammelt werden. Bitte kontaktieren Sie die jeweiligen Anbieter für weitere Informationen und zur Ausübung Ihrer Rechte. <br /> <br />",
  "privacy.line_28": "<strong>6. Datensicherheit</strong><br />",
  "privacy.line_29": "Wir bemühen uns, Ihre Daten durch entsprechende technische und organisatorische Maßnahmen zu schützen. Die Sicherheit Ihrer Daten ist uns wichtig, und wir verwenden sicherheitsrelevante Maßnahmen gemäß den gesetzlichen Anforderungen. <br /> <br />",
  "privacy.line_30": "<strong>7. Verwendete Begrifflichkeiten</strong><br />",
  "privacy.line_31": "Personenbezogene Daten sind Informationen, die sich auf eine identifizierte oder identifizierbare natürliche Person beziehen. In diesem Zusammenhang können personenbezogene Daten von AdMob und AdSense gesammelt und verarbeitet werden. <br /> <br />",
  "privacy.line_32": "<strong>8. Änderungen dieser Datenschutzerklärung</strong><br />",
  "privacy.line_33": "Wir behalten uns das Recht vor, diese Datenschutzerklärung zu ändern, um den rechtlichen Anforderungen zu entsprechen oder Änderungen unserer Datenverarbeitungspraktiken widerzuspiegeln. Bitte überprüfen Sie diese Erklärung regelmäßig, um auf dem Laufenden zu bleiben. <br />",
  "privacy.line_34": "Datum: 09.03.2025 <br /> <br />"
}
