{
  "settings_Title": "Настройки",
  "settings_DeleteAll": "Удалить все локальные данные",
  "settings_DeleteUserAndData": "Удалить пользователя",
  "settings_DeleteUserConfirmDialog": "Вы уверены, что хотите удалить пользователя?",
  "settings_DeleteUserErrorContactAdmin": "Произошла ошибка. Выйдите и войдите снова. Если проблема не исчезнет, свяжитесь с нами через юридическую информацию.",
  "settings_EmailPasswordRequiredToDelete": "Для удаления аккаунта необходимо войти в систему!",
  "settings_Information": "Информация",
  "settings_Datenschutz": "Политика конфиденциальности",
  "settings_Impressum": "Юридическая информация",
  "settings_GitHubRepo": "Репозиторий GitHub",
  "setting_Menu_OpenSourceModulList": "Используемые библиотеки",
  "setting_OpenSurceModulListTItle": "Используемые библиотеки NPM",
  "setting_OpenSourceModulListClose": "Закрыть",
  "settings_Dialog_DeleteAllSuccessful": "Все данные успешно удалены. Перезапустите приложение, чтобы предотвратить сохранение новых данных!",
  "settings_Dialog_DeleteAll": "Вы уверены, что хотите удалить все записи?",
  "navbar_searchForm": "Поиск карты...",
  "noCardsThere": "Пока нет карт... Нажмите кнопку «плюс», чтобы добавить!",
  "newCard_Title": "Новая карта клиента",
  "newCard_shopForm": "Введите название магазина",
  "newCard_selectColor": "Выберите цвет",
  "newCard_scannedSuccessfully": "Успешно отсканировано: ",
  "newCard_addedSuccessfully": "Успешно добавлено!",
  "newCard_errorAdding": "Произошла ошибка, попробуйте снова!",
  "newCard_missingInformation": "Введите название магазина и отсканируйте карту!",

  "privacy.line_1": "<strong>Настоящая политика конфиденциальности и информация доступны на английском языке и других языках.</strong>",
  "privacy.line_2": "<strong>Она всегда отображается на языке вашего устройства, если мы его поддерживаем.</strong> <br /> <br />",
  "privacy.line_3": "<strong>Политика конфиденциальности для веб-сайта/приложения</strong> <br /><br />",
  "privacy.line_4": "Благодарим вас за посещение нашего веб-сайта/приложения. Мы придаем большое значение защите ваших данных и хотим предоставить вам обзор того, как мы обрабатываем ваши данные в соответствии с Общим регламентом по защите данных (GDPR), европейскими законами о защите данных, Законом Калифорнии о защите прав потребителей (CCPA) и законодательством Калифорнии. <br /> <br />",
  "privacy.line_5": "<strong>1. Ответственное лицо</strong><br />",
  "privacy.line_6": "Ответственным за обработку ваших данных и издателем этого приложения является: <br />",
  "privacy.line_7": "Кристиан Шойб <br />",
  "privacy.line_8": "Цигеляккер 56 <br />",
  "privacy.line_9": "71560 Зульцбах-ан-дер-Мурр <br /> <br />",
  "privacy.line_10": "Контактный телефон: +49 176 21674883 <br />",
  "privacy.line_11": "Генеральный директор/владелец: Кристиан Шойб <br />",
  "privacy.line_12": "Если у вас есть вопросы или замечания по поводу конфиденциальности, пожалуйста, свяжитесь с нами по адресу christian.developer.app@gmail.com. <br />",
  "privacy.line_13": "Ссылка на выходные данные: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint <br /> <br />",
  "privacy.line_14": "<strong>2. Файлы cookie, IndexedDB и аналогичные технологии</strong><br />",
  "privacy.line_15": "Мы используем файлы cookie и аналогичные технологии, чтобы предложить вам персонализированную рекламу и улучшить производительность нашего веб-сайта/приложения. Это включает в себя файлы cookie, которые сохраняются на вашем устройстве. Эти технологии помогают нам сохранять ваши предпочтения и оптимизировать пользовательский опыт. <br />",
  "privacy.line_16": "Кроме того, мы используем локальную IndexedDB для локального хранения клиентских карт. Ваши клиентские карты всегда остаются локальными. <br />",
  "privacy.line_17": "IndexedDB — это полностью локальная база данных SQL в браузере, которую можно представить как большую таблицу, в которой мы храним ваши данные. <br /> <br />",
  "privacy.line_18": "<strong>3. Сбор и обработка данных с помощью AdMob и AdSense</strong><br />",
  "privacy.line_19": "Мы используем AdMob и AdSense для отображения персонализированной рекламы. Эти сервисы могут использовать файлы cookie и аналогичные технологии для сбора данных о вашем использовании веб-сайта/приложения и предоставления персонализированной рекламы. Собранные этими сервисами данные могут включать:",
  "privacy.line_20": "- Ваш IP-адрес",
  "privacy.line_21": "- Информацию о вашем взаимодействии с веб-сайтом/приложением",
  "privacy.line_22": "- Информацию о вашем устройстве",
  "privacy.line_23": "Собранные данные обрабатываются в соответствии с политиками конфиденциальности Google. Дополнительную информацию можно найти в политиках конфиденциальности Google AdMob и Google AdSense. <br /> <br />Для получения вашего согласия на персонализированную рекламу мы используем <strong>Google User Messaging Platform (UMP)</strong>, которая основана на <strong>Transparency and Consent Framework (TCF) версии 2.2</strong> от <strong>IAB Europe</strong>. При первом запуске приложения или после истечения срока действия вашего предыдущего решения вам будет представлено окно запроса согласия, позволяющее указать, согласны ли вы и в какой степени на обработку данных. Собранные согласия касаются, в частности, персонализированной рекламы, измерений и передачи данных третьим сторонам. Ваш выбор сохраняется локально и может быть отозван или изменен в любое время. <br /> <br />",  "privacy.line_24": "<strong>4. Продажа данных</strong><br />",
  "privacy.line_25": "Мы не продаем ваши данные. Данные, собранные AdMob и AdSense, подчиняются политикам конфиденциальности соответствующих поставщиков. <br /> <br />",
  "privacy.line_26": "<strong>5. Ваши права</strong><br />",
  "privacy.line_27": "Вы имеете право запрашивать информацию о хранящихся о вас данных, требовать их исправления или удаления, а также ограничивать их обработку. Поскольку мы не храним собственные данные, эти права относятся к данным, собранным AdMob и AdSense. Пожалуйста, свяжитесь с соответствующими поставщиками для получения дополнительной информации и реализации ваших прав. <br /> <br />",
  "privacy.line_28": "<strong>6. Безопасность данных</strong><br />",
  "privacy.line_29": "Мы прилагаем усилия для защиты ваших данных с помощью соответствующих технических и организационных мер. Безопасность ваших данных важна для нас, и мы используем меры безопасности в соответствии с законодательными требованиями. <br /> <br />",
  "privacy.line_30": "<strong>7. Используемые термины</strong><br />",
  "privacy.line_31": "Персональные данные — это информация, относящаяся к идентифицированному или идентифицируемому физическому лицу. В этом контексте персональные данные могут быть собраны и обработаны AdMob и AdSense. <br /> <br />",
  "privacy.line_32": "<strong>8. Изменения в настоящей политике конфиденциальности</strong><br />",
  "privacy.line_33": "Мы оставляем за собой право изменять настоящую политику конфиденциальности, чтобы соответствовать законодательным требованиям или отражать изменения в наших практиках обработки данных. Пожалуйста, регулярно проверяйте эту политику, чтобы быть в курсе. <br />",
  "privacy.line_34": "Дата: 03.05.2025 <br /> <br />",
  "privacy.update_2025_05": "Наша политика конфиденциальности была обновлена. Теперь мы конкретно указываем, что используем диалоговое окно согласия Google AdMob (User Messaging Platform) для получения вашего согласия на обработку данных. Пожалуйста, ознакомьтесь с обновленной политикой конфиденциальности."
}
